Repository: yusuaois/triggeo
Catalog: lib/l10n/app_*.arb
Languages: de

source: Hello World
de: Hallo Welt

# mapApiKeyTitle
source: API Key
de: API-Schlüssel

# mapApiKeyHint
source: Please enter your API Key
de: Bitte geben Sie Ihren API-Schlüssel ein

# mapCancel
source: Cancel
de: Abbrechen

# mapConfirm
source: Confirm
de: Bestätigen

# needApiKey
source: Please set API Key for {name}
de: Bitte geben Sie den API-Schlüssel für {name} ein

# mapSearchFailed
source: Search failed: {error}
de: Suche fehlgeschlagen: {error}

# mapGetLocationFailed
source: Get location failed: {error}
de: Standortabruf fehlgeschlagen: {error}

# mapLocating
source: Locating...
de: Ortung läuft...

# mapSearchHint
source: Search location
de: Ort suchen

# mapSearchEmptyError
source: Please enter search keywords
de: Bitte geben Sie Suchbegriffe ein

# mapLocationFailed
source: Location failed: {error}
de: Ortung fehlgeschlagen: {error}

# mapLongPressHint
source: Long press anywhere on the map to add a reminder
de: Langes Drücken auf eine beliebige Stelle auf der Karte, um eine Erinnerung hinzuzufügen

# mapNoSearchResults
source: No search results found
de: Keine Suchergebnisse gefunden

# settingsRingtoneSaved
source: Ringtone saved: {ringtoneName}
de: Klingelton gespeichert: {ringtoneName}

# settingsTitle
source: Settings
de: Einstellungen

# settingsThemeSection
source: Theme
de: Thema

# settingsDynamic
source: Dynamic Color (Material You)
de: Dynamische Farbe (Material You)

# settingsSystemWallpaperColor
source: System Wallpaper Color
de: System-Hintergrundfarbe folgen (nur Android 12+)

# settingsCustomThemeColor
source: Custom Theme Color
de: Benutzerdefinierte Themenfarbe

# settingsDarkMode
source: Dark Mode
de: Dunkelmodus

# settingsLightMode
source: Light Mode
de: Lichtmodus

# settingsThemeSystem
source: Follow System
de: System folgen

# settingsThemeLight
source: Light
de: Hell

# settingsThemeDark
source: Dark
de: Dunkel

# settingsReminderSection
source: Reminder Settings
de: Erinnerungseinstellungen

# settingsReminderType
source: Reminder Type
de: Erinnerungstyp

# settingsReminderRingtone
source: Ring
de: Klingeln

# settingsReminderVibration
source: Vibrate
de: Vibration

# settingsReminderBoth
source: Ring & Vibrate
de: Klingeln und Vibration

# settingsReminderVibrationNotSupport
source: Vibration is not supported on this device
de: Dieses Gerät unterstützt keine Vibration

# settingsCustomRingtone
source: Custom Reminder Ringtone
de: Benutzerdefinierter Benachrichtigungston

# settingsPickRingtone
source: Tap to select audio file
de: Tippen Sie, um eine Audiodatei auszuwählen

# settingsRintoneFileNotFound
source: Unable to play audio, file not found: {filePath}
de: Audiodatei unter Pfad {filePath} nicht gefunden

# settingsRintonePlayFiled
source: Unable to play audio: {error}
de: Wiedergabe der Audiodatei fehlgeschlagen, Fehler: {error}

# settingsCustomVibrationPattern
source: Custom Vibration Pattern
de: Benutzerdefiniertes Vibrationsmuster

# settingsEditVibrationPattern
source: Edit Vibration Pattern
de: Vibrationsmuster bearbeiten

# settingsVibrationPatternHint
source: e.g. 0, 100, 50, 100, 500, 200
de: Beispiel: 0, 100, 50, 100, 500, 200

# settingsVibrationPatternHelp
source: Enter a comma-separated list of integers: delay, duration, delay, duration... (in milliseconds).
de: Geben Sie eine kommagetrennte Liste von Ganzzahlen ein: Verzögerung, Dauer, Verzögerung, Dauer... (Einheit: Millisekunden).

# settingsVibrationPatternSaved
source: Vibration pattern saved: {pattern}
de: Vibrationsmuster gespeichert: {pattern}

source: Cancel
de: Abbrechen

source: Save
de: Speichern

# settingsTestSetting
source: Test Setting
de: Aktuelle Einstellungen testen

# settingsDistanceFilter
source: Distance Filter({distanceFilter} m)
de: Standortaktualisierungsentfernung ({distanceFilter} Meter)

# settingsDistanceFilterHint
source: Minimum distance to update location (in meters). The smaller the value, the more frequent the location update, but the higher the battery consumption
de: Stellt die minimale Entfernung für Standortaktualisierungen (in Metern) ein. Kleinere Werte führen zu häufigeren Aktualisierungen, aber höherem Batterieverbrauch.

# settingsLocationUpdate
source: Location Update
de: Standortaktualisierungseinstellungen

# settingsMapDataSection
source: Map & Data
de: Karte und Daten

# settingsOfflineMap
source: Offline Maps
de: Offline-Karten

# settingsManageOfflineMap
source: Manage Downloaded Maps
de: Heruntergeladene Karten verwalten

# settingsTileSource
source: Tile Source
de: Kartenquelle

# settingsTileSourceRestart
source: Tile source changed. Restart app to take effect
de: Kartenquelle wurde gewechselt, tritt nach Neustart der App in Kraft

# offlineMapAddedToQueue
source: Added to download queue
de: Zur Download-Warteschlange hinzugefügt

# offlineMapTitle
source: Offline Map Management
de: Offline-Kartenverwaltung

# offlineMapTabNew
source: Download New Map
de: Neue Karten herunterladen

# offlineMapTabTasks
source: Tasks & Downloaded
de: Aufgaben und Heruntergeladenes

# offlineMapLoadingData
source: Loading offline map data...
de: Offline-Kartendaten werden geladen...

# offlineMapLoadFailed
source: Load failed: {error}
de: Laden fehlgeschlagen: {error}

# offlineMapSearchHint
source: Search city
de: Stadt suchen

# offlineMapSearchButton
source: Search
de: Suchen

# offlineMapSearching
source: Searching...
de: Wird gesucht...

# offlineMapNoResults
source: No results found
de: Keine Suchergebnisse gefunden

# offlineMapDownloadAction
source: Download
de: Herunterladen

# offlineMapStatusDownloading
source: Downloading {percent}%
de: Wird heruntergeladen {percent}%

# offlineMapStatusCompleted
source: Completed
de: Abgeschlossen

# offlineMapStatusFailed
source: Download failed
de: Download fehlgeschlagen

# offlineMapStatusPaused
source: Paused
de: Pausiert

# offlineMapStatusCanceled
source: Canceled
de: Abgebrochen

# offlineMapStatusPending
source: Pending...
de: Ausstehend...

# offlineMapResumeAction
source: Resume
de: Fortsetzen

# offlineMapDeleteAction
source: Delete
de: Löschen

# offlineMapNoTasks
source: No tasks
de: Keine Aufgaben vorhanden

# reminderNameRequired
source: Please enter a name
de: Bitte geben Sie einen Namen ein

# reminderSaveFailed
source: Save failed: {error}
de: Speichern fehlgeschlagen: {error}

# reminderDetailTitle
source: Set Reminder
de: Erinnerung einstellen

# reminderNameLabel
source: Location Name
de: Name des Ortes

# reminderNameHint
source: e.g., Supermarket, Office
de: Beispiel: Supermarkt, Arbeit

# reminderRadiusText
source: Reminder radius: {radius} meters
de: Erinnerungsradius: {radius} Meter

# saveAction
source: Save
de: Speichern

# reminderListTitle
source: My Reminders
de: Meine Erinnerungen

# reminderListEmpty
source: No reminders yet
de: Keine Erinnerungen vorhanden

# reminderListItemSubtitle
source: Radius: {radius}m Coordinates: {lat}, {lon}
de: Radius: {radius}m Koordinaten: {lat}, {lon}

# reminderEditTitle
source: Add/Edit Reminder
de: Erinnerung hinzufügen/bearbeiten

# reminderDetailInfo
source: Latitude: {lat} Longtitude: {lon}
de: Breitengrad: {lat} Längengrad: {lon}

source: Reminder created
de: Erinnerung wurde erstellt

source: Reminder updated
de: Erinnerung wurde aktualisiert

# cancelAction
source: Cancel
de: Abbrechen

# backgroundServiceTitle
source: Triggeo Background Detection
de: Triggeo Hintergrundüberwachung

# backgroundServiceContent
source: Background location detection running...
de: Hintergrund-Standortüberwachung läuft...

# backgroundServicePermissionError
source: Unable to start background service. Please ensure location permission is granted.
de: Hintergrunddienst konnte nicht gestartet werden, stellen Sie sicher, dass die Standortberechtigung erteilt wurde

# backgroundServiceAlwaysPermissionError
source: Insufficient location permission. Please grant "Always" permission in system settings to ensure background reminder functionality.
de: Unzureichende Standortberechtigung. Bitte erteilen Sie in den Systemeinstellungen die Berechtigung „Immer zulassen“, um die ordnungsgemäße Funktion der Hintergrunderinnerung zu gewährleisten.

# backgroundServiceStarted
source: Background location service started
de: Hintergrund-Standortdienst wurde gestartet

# backgroundServiceStopped
source: Background location service stopped
de: Hintergrund-Standortdienst wurde beendet

# locationServiceAlertTitle
source: Reminder Triggered: {name}
de: Erinnerung ausgelöst: {name}

# arrivalAlertTitle
source: üìç Arrival Alert: {name}
de: 📍 Ankunftserinnerung: {name}

# arrivalAlertBody
source: You have arrived at Target Location
de: Sie haben das Zielgebiet erreicht

# backgroundChannelName
source: Background Running Service
de: Hintergrund-Dienst

# backgroundChannelDesc
source: Keep app running in background to detect location
de: Hält die App im Hintergrund, um den Standort zu überwachen

# alertChannelName
source: Location Arrival Reminder
de: Standort-Ankunftserinnerung

# alertChannelDesc
source: Notify when arriving at a destination
de: Erinnert Sie, wenn Sie am Zielort angekommen sind

# downloadChannelName
source: Map Download Progress
de: Karten-Download-Fortschritt

# downloadChannelDesc
source: Show progress of offline map downloads
de: Zeigt den Fortschritt des Offline-Karten-Downloads an

# downloadProgressTitle
source: Downloading offline map ({activeTasks} tasks)
de: Offline-Karten werden heruntergeladen ({activeTasks} Aufgaben)

# notificationDownloadFailedTitle
source: Download failed: {error}
de: Download fehlgeschlagen: {error}

# notificationDownloadFailedBody
source: Please check network and try again
de: Bitte überprüfen Sie die Netzwerkverbindung und versuchen Sie es erneut
